#!/usr/bin/env python
# -*- coding: utf-8 -*-

# File:mysql.py
# Author：GaoBo
# Time:2019/03/01

import pymysql
import random
from faker import Faker
class MysqlQuery:
	def __init__(self):
		try:
			self.mysql = pymysql.Connect(host='192.168.1.96', user='root', password='123456', port=3306,database='emis_test',cursorclass=pymysql.cursors.DictCursor)
		except Exception as e:
			raise e
	def sql_query(self,sql):
		'''
		通用数据库查询
		:param sql:
		:return:
		'''
		cur =self.mysql.cursor()
		cur.execute(sql)
		cur.close()
		return cur.fetchone()
	def cardnum(self):  #输出患者卡号
		fake =Faker()
		cur = self.mysql.cursor()
		cur.execute('SELECT DISTINCT(cardnum) FROM `trt_patient`  WHERE cardnum !=""')
		b = []
		for i in cur.fetchall():
			a = i['cardnum']
			if a.isdigit():
				b.append(int(a))
		cardnum =fake.ean13()
		while cardnum in b:
			cardnum = fake.ean13()
			if cardnum not in b:
				break
		return cardnum



	def fullname(self):          #随机姓名
		xing='赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方' \
			 '俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗郝邬安常乐于时傅'
		ming='观博欣竹欣阳刚军扬阳靖阳熙阳嘉萱铭阳飞雨荨文博诗含诗若辰海晓雨展鸣晓春洪文默轩杰金海俊杰展旭建烁婧琪婧涵诗晴传浩怡萍诗涵雅婷雅涵萍晓萍兴飞小平建龙宇谟子辰辰湍灵骅株春莲娟敏智涵欣妍慧妍雅静月婷雨婷芸馨韵涵涵韵雨欣馨蕾静媛子涵雨泽静蕾茛淯珑沧芮娟梓萱轶诚嘉文晓朋一凡昊楠浩楠瑞君佳宁雨杨昊然浩然滕浩雨菡海一晨宸之政晨菲修闻宁夫轩春菲佳涵耀宇耀雨翠鑫雨涵熙继欣菲兰月兰欣岚欣懿明淑菲荣凯海瑶涵雅晨曦麟炜茜子萱玥菲雯菲云涵靖雯馨怡江运浩飞飞强国馨国鑫雅雯炳君海宇海林瑾瑜成龙嘉麟芸惜芸希瀚曦晏鑫龙嘉懿永琴贝馨润芝润龙浩龙焱涵芙敖菲子君少兹子晨辰曦云曦梓恒晏畅晏郡洛瑜朔瑜晃郡展彰展荣展郡展瑜朔诰洛荣紫涵蕾津轩旗津诰津郡津荣津畅津飒津彰津瑜桀诰晃荣轩语桀瑔晃瑜晃荣泽小强晏诰桀畅悦桀荣桀彰宸赫桀郡桀瑜晋嘉铭永子伦学友业昆新沅宇铭昊劳海驰皓晨皓一露桐冉曦予曦于伟惠馨铭哲雯晴洛晏荣耀尉瑜晏诰升娟濡丞曜羽曜丞润汐芸果峻熙小勇靓熙亨荣雨果子易梓易培熙翰森熙涵柏辉冠鹏函耀嘉腾辉赐瑜霖荣昙熙珍嘉炎嘉彦嘉逸锦荣霖畅嘉盛健柏圣泽嘉旺泽楠文柏家瑜泽扬皓曜嘉硕家瑄涵曜曜栋嘉朔嘉翔曜捷翊鹏释晏家轩晋耀佳轩嘉轩耀桀嘉帅嘉耀嘉博洪语澍茧又谱甑巍菁启航建亮书仪柯焱妍晴海东亮轩轩齐航嘉亮琼琳宸玥烨然文焓文烨方烨哲恺缠颐艺耀汉楚力旌鼎辉秋明涵茹涵亮湾锐燕姿家妍峥一鸣家硕益睿祥福琼芮鑫芮馨芮雅凡斌旭辉尹航昕珏智宸子馨若菲子舒若茹婷茹琬婷平翼浩晨雨雨轩嘉辰明昊明皓明轩梦阳阳泽泽敏毅轩易安雨晨璟鹏鹏意旭天佑晗雨绎阳阳绎曜潍濡曜旭毅潍浚旭翌曜浚旭逸释霖旭洋旭阳璋耀潮耀释潮芳理桃云香泽唐湘黔释譞释鸿旭尧鸿耀阳释释阳泽耀曜鹏曜绎绎曜浚绎赞浚绎浚池旭晓强云翔孝羽旭亨君羽军仁丞孝旭言羽汐旭江丞亨永函永明永坤奕天晓芳昶升昶天彦天天彦天奕天冠天育升昶升泉晶晶升映升彦升冠升育岂鸣瑜菲汝菲永年羽旭蒂菲旭丞丞羽丞旭孝永淳雅亨立立孝立言永言永亨函天雨升承升坤升函升天明天函至远兆腾其贤雅淇天烁惜梦沛博诗雅沛梦菡丹彤涵函艺涵腾运展迎朔翔伦敖朔敖文松桃云馨菲亦萌永耀德骁鸾寇芳语佳乐一辰一宸淏瑄致远灏颖冲曦文浩烨浩杰兰丽帝儒泊君轩昂志鹏嘉澍瀚玥瀚彭骝萱錦汇文汇煊熙紫菡其昌锦贤琳怀冬雨辰鸿达晟铭硕岁宁澜夕蕊祐齐羽欣子璇嘉怡湾销骥演天逊逻履凯轩凯淇凯勋凯歌凯泽凌晓宏嘉源錦沦翔涵錦汛煜智躍育硕岚一鎔洲煕浩一涵培吉才晓杰帅帅一一敖华一易一漪凌菲香菲倩雪其烁其昱雪菲秀菲小菲梦菲婧菲思淼倩菲清宇帆夏菲雅菲懿亦菲贝菲瀚航依菲铱菲曜棟钰菲家菲欣月菲雨菲素菲莹予博航芬菲芳菲洛菲博涵馨月译丹梦瑶智鹏琬珊琬紫紫嫣嫣珊嫣姗嫣笑琳童涵瑶淳皓恵瑞灵皓雯雅雯皓瑞天霖令璟芠雨浦浦和佲哲暻熙浩博鴻德浩瀚家瑞明宇凯瑞铭瑞航瑞建辉耀睦少军德海滨橦滨洪滔玉玺舒涵玉珍梓琦轩豪紫轩笑莲梓轩芯妍洛嘉泷文荣轩浩宇鸿涛正豪明杰烨伟楷瑞哲瀚光耀光熙光明光亮光辉光华刚毅刚捷刚豪飞昂德曜德润德辉承泽占润郁秦力鑫奕静玉涵益茜金烨金龙俊威天豪博文博涛博明博瀚毅龙彬彬宾鸿安翔昂雄安晏安顺安民安康安和安福安邦栤婕月鑫文硕昕晨伊冉少英天赐文雨允晨子龙佳怡柳宁倚鸣晶嘉睿嘉熙婷煜祺睿祺文昊旭博越维哲宸瑜孜钰嘉豪海鑫启腾启初国君佩咚涵琪轩太砧审恒溢恒硕咨晨恒仔晨怀宇怀辰文源洺源雅楠涵福书源晓华小慧欣梦雯靖錦永顺田錦原丹丹韫澜诺之源悦悦君晖志浩雨馨思源好泽语武诚清晨俊诚锦永锦源俊成煕成羲成成诚文诚家宁嘉成继成哲成梓成逸成皓成旭成颂和鑫成翌成宇诚家豪君昊成虎万年梁超毅永胜璟雯骏皓晓翰晴岚泽露晓岚昊成辰昊成昊昱成鸾觅振庭章旭付豪振鹏夏菡宁致嘉志晓峰语桐誉桐颢光稀诚韵怡云涛立新澜清宸宇颢胧城铭炎强辨珍娜馨尹煜城纾语萌萌凯文曦晨明曦鑫凯翔乾坤沣嘉祺嘉骏嘉晨嘉然梓宸子麟景晨嘉瀚跃铭凯嘉君锦晨嘉锐嘉悦嘉鹏嘉伟嘉弘嘉景嘉鸿雁景麟錦泰镡启纾涵纾萌书福浩洛午章彩艳少宇泳玲瀚友瑞祥旭烽烽波宏美家睿珈睿丽佳琪依晨康天英晋玮建宇建康予寒雪栩传想瑞辰秦豪皓峻文佳泽腾晨敏永泽篱霭隰岸文玉静文兵涛向泽静宇灿熙墨欢欢欢羽轩墨涵元资梓涵莹朵国祥嘉诺爱君云咏烨梓欣金鹏鹭洋念波芮晨惠议皓轩芯蕊煜岩雪娇新苗靖媛天硕嘉甜涵雁毅佑嘉扬涵蕾芷倩芷婧信哲文艳星鹏海洲春曜瑞泽雨泽宇缦妮嘉涵园园可倩芸德轩铠玺韫麒丛韬涵悦德荣春雷睿麟冠楠淑芬睿霖格镌恩逵国荣国豪国泽睿辰暂骥团燚靖才涵玉雨涵熙瞳熙彤雅琪瀚圣益菲益鸣益华镔泶畅悦斤檀立行涔朔銮洛庭硕紫琦紫琪妙涵子墨易阳西宇一泽静茹易扬富慧家祥建东瀚文敖通明真舒雅艺欣若雨炘磊锌磊智磊新磊家槊鑫磊圣杰怡晖沅培博翰家朔家蒴家城智轩子俊智杰亿斌家程垣涛澍域泽城国嵓国漾扬国国阳国杨呈双'
		X=random.choice(xing)
		M="".join(random.choice(ming) for i in range(2))
		return X+M
get_sql = MysqlQuery()
if __name__ == '__main__':
	print((MysqlQuery().cardnum()))